stevenj/avr-libc3/include/avr/io/attiny828.h
/******************************************************************************
 *   This file is part of avr-libc3.                                          * 
 *                                                                            * 
 *   Automatically created by devtools/gen-ioheader-atdf.py (V0.91)           * 
 *                                                                            * 
 *   .atpack File: ATtiny828.atdf                                             * 
 *   .ATDF File:   atdf/ATtiny828.atdf                                        * 
 *   Version:      2.0.10                                                     * 
 *   Date:         2019-04-25                                                 * 
 *   Device:       ATtiny828                                                  * 
 *   Architecture: AVR8                                                       * 
 *                                                                            * 
 *   Changelog:                                                               * 
 *                                                                            * 
 *   2.0.10 2019-04-25 :                                                      * 
 *        - Added missing TCB1 PORTMUX for tiny3217/3216/1617/1616/1614.      * 
 *    2.0.2 2019-01-24 :                                                      * 
 *        - Corrected TC2 instance in ATtiny441.                              * 
 *        - Corrected defines for ATtiny1634.                                 * 
 *        - Refactored away family header files, now there is one header file * 
 *        - per device.                                                       * 
 *        - Corrected FUSE_MEMORY_SIZE for ATtiny4/5/9/10/20/40.              * 
 *        - Added simulator support for mega1609/1608/809/808.                * 
 *        - Succeeds Atmel.ATtiny_DFP 1.3.229.                                * 
 *                                                                            * 
 *   Generated Source Derived from data:                                      * 
 *   Copyright (c) 2019 Microchip Technology Inc.                             * 
 *                                                                            * 
 *   Licensed under the Apache License, Version 2.0 (the "License");          * 
 *   you may not use this file except in compliance with the License.         * 
 *   You may obtain a copy of the Licence at                                  * 
 *                                                                            * 
 *       http://www.apache.org/licenses/LICENSE-2.0                           * 
 *                                                                            * 
 *   Unless required by applicable law or agreed to in writing, software      * 
 *   distributed under the License is distributed on an "AS IS" BASIS,        * 
 *   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied. * 
 *   See the License for the specific language governing permissions and      * 
 *   limitations under the License.                                           * 
 ******************************************************************************/


#ifndef _AVR_IO_H_
#  error "Include <avr/io.h> instead of this file."
#endif

#ifndef _AVR_IOXXX_H_
#  define _AVR_IOXXX_H_ "ioATtiny828.h"
#else
#  error "Attempt to include more than one <avr/ioXXX.h> file."
#endif

#ifndef _AVR_ATtiny828_H_INCLUDED
#  define _AVR_ATtiny828_H_INCLUDED

/*
================================================================================
Ungrouped common register
================================================================================
*/

#define GPIOR0    _SFR_MEM8 (0x3E) /* General Purpose I/O Register 0 */

#define GPIOR1    _SFR_MEM8 (0x4A) /* General Purpose I/O Register 1 */
#define GPIOR2    _SFR_MEM8 (0x4B) /* General Purpose I/O Register 2 */

#define SMCR      _SFR_MEM8 (0x53) /* Sleep Mode Control Register */
#define MCUSR     _SFR_MEM8 (0x54) /* MCU Status Register */
#define MCUCR     _SFR_MEM8 (0x55) /* MCU Control Register */
#define CCP       _SFR_MEM8 (0x56) /* Configuration Change Protection */
#define SPMCSR    _SFR_MEM8 (0x57) /* Store Program Memory Control and Status Register */

#define SP        _SFR_MEM16(0x5D) /* Stack Pointer  */
#define SREG      _SFR_MEM8 (0x5F) /* Status Register */

#define CLKPR     _SFR_MEM8 (0x61) /* Clock Prescale Register */

#define PRR       _SFR_MEM8 (0x64) /* Power Reduction Register */

#define OSCCAL0   _SFR_MEM8 (0x66) /* Oscillator Calibration Register 8MHz */
#define OSCCAL1   _SFR_MEM8 (0x67) /* Oscillator Calibration Register 32kHz */

#define OSCTCAL0A _SFR_MEM8 (0xF0) /* Oscillator Temperature Calibration Register A */
#define OSCTCAL0B _SFR_MEM8 (0xF1) /* Oscillator Temperature Calibration Register B */


/*
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
C LANGUAGE - ONLY
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
*/

#if !defined (__ASSEMBLER__)
/*
================================================================================
IO Module Structures
================================================================================
*/


/*
--------------------------------------------------------------------------------
FUSE - Fuses
--------------------------------------------------------------------------------
*/

typedef struct FUSE_struct
{
    register8_t LOW;     
    register8_t HIGH;    
    register8_t EXTENDED;
} FUSE_t;


/* Select boot size */
typedef enum FUSE_BOOTSZ_enum
{
    FUSE_BOOTSZ_128W_0F80_gc  = (0x03<<1), /* Boot Flash size=128 words Boot address=$0F80 */
    FUSE_BOOTSZ_256W_0F00_gc  = (0x02<<1), /* Boot Flash size=256 words Boot address=$0F00 */
    FUSE_BOOTSZ_512W_0E00_gc  = (0x01<<1), /* Boot Flash size=512 words Boot address=$0E00 */
    FUSE_BOOTSZ_1024W_0C00_gc = (0x00<<1), /* Boot Flash size=1024 words Boot address=$0C00 */
} FUSE_BOOTSZ_t;

/* Boot Reset vector Enabled */
typedef enum FUSE_BOOTRST_enum
{
    FUSE_BOOTRST_CLEAR_gc = (0x00), /* Boot Reset vector Enabled - CLEAR */
    FUSE_BOOTRST_SET_gc   = (0x01), /* Boot Reset vector Enabled - SET */
} FUSE_BOOTRST_t;

/* BOD mode of operation when the device is in sleep mode */
typedef enum FUSE_BODPD_enum
{
    FUSE_BODPD_BOD_SAMPLED_gc  = (0x01<<6), /* Sampled */
    FUSE_BODPD_BOD_ENABLED_gc  = (0x02<<6), /* Enabled */
    FUSE_BODPD_BOD_DISABLED_gc = (0x03<<6), /* Disabled */
} FUSE_BODPD_t;

/* BOD mode of operation when the device is active or idle */
typedef enum FUSE_BODACT_enum
{
    FUSE_BODACT_BOD_SAMPLED_gc  = (0x01<<4), /* Sampled */
    FUSE_BODACT_BOD_ENABLED_gc  = (0x02<<4), /* Enabled */
    FUSE_BODACT_BOD_DISABLED_gc = (0x03<<4), /* Disabled */
} FUSE_BODACT_t;

/* Reset Disabled (Enable PC6 as i/o pin)] */
typedef enum FUSE_RSTDISBL_enum
{
    FUSE_RSTDISBL_CLEAR_gc = (0x00), /* Reset Disabled (Enable PC6 as i/o pin)] - CLEAR */
    FUSE_RSTDISBL_SET_gc   = (0x80), /* Reset Disabled (Enable PC6 as i/o pin)] - SET */
} FUSE_RSTDISBL_t;

/* Debug Wire enable */
typedef enum FUSE_DWEN_enum
{
    FUSE_DWEN_CLEAR_gc = (0x00), /* Debug Wire enable - CLEAR */
    FUSE_DWEN_SET_gc   = (0x40), /* Debug Wire enable - SET */
} FUSE_DWEN_t;

