stevenj/avr-libc3/include/avr/io/attiny828.h
/* Timer/Counter Synchronization Mode */
typedef enum TC1_TSM_enum
{
    TC1_TSM_CLEAR_gc = (0x00), /* Timer/Counter Synchronization Mode - CLEAR */
    TC1_TSM_SET_gc   = (0x80), /* Timer/Counter Synchronization Mode - SET */
} TC1_TSM_t;

/* Prescaler Reset Timer/Counter1 and Timer/Counter0 */
typedef enum TC1_PSRSYNC_enum
{
    TC1_PSRSYNC_CLEAR_gc = (0x00), /* Prescaler Reset Timer/Counter1 and Timer/Counter0 - CLEAR */
    TC1_PSRSYNC_SET_gc   = (0x01), /* Prescaler Reset Timer/Counter1 and Timer/Counter0 - SET */
} TC1_PSRSYNC_t;

/*
--------------------------------------------------------------------------------
TOCPM - Timer/Counter Output Compare Pin
--------------------------------------------------------------------------------
*/

typedef struct TOCPM_struct
{
    register8_t rsv_0x00[226]; /* RESERVED REGISTER BLOCK */
    register8_t TOCPMCOE;      /* Timer Output Compare Pin Mux Channel Output Enable */
    register8_t rsv_0xE3[5];   /* RESERVED REGISTER BLOCK */
    register8_t TOCPMSA0;      /* Timer Output Compare Pin Mux Selection 0 */
    register8_t TOCPMSA1;      /* Timer Output Compare Pin Mux Selection 1 */
} TOCPM_t;


/* Timer Output Compare Channel 7 Selection Bits */
#define TOCPM_TOCPMSA1_TOCC7S_gc(x) ((x<<6) & 0xC0)

/* Timer Output Compare Channel 6 Selection Bits */
#define TOCPM_TOCPMSA1_TOCC6S_gc(x) ((x<<4) & 0x30)

/* Timer Output Compare Channel 5 Selection Bits */
#define TOCPM_TOCPMSA1_TOCC5S_gc(x) ((x<<2) & 0x0C)

/* Timer Output Compare Channel 4 Selection Bits */
#define TOCPM_TOCPMSA1_TOCC4S_gc(x) (x & 0x03)

/* Timer Output Compare Channel 3 Selection Bits */
#define TOCPM_TOCPMSA0_TOCC3S_gc(x) ((x<<6) & 0xC0)

/* Timer Output Compare Channel 2 Selection Bits */
#define TOCPM_TOCPMSA0_TOCC2S_gc(x) ((x<<4) & 0x30)

/* Timer Output Compare Channel 1 Selection Bits */
#define TOCPM_TOCPMSA0_TOCC1S_gc(x) ((x<<2) & 0x0C)

/* Timer Output Compare Channel 0 Selection Bits */
#define TOCPM_TOCPMSA0_TOCC0S_gc(x) (x & 0x03)

/* Timer Output Compare Channel 7 Output Enable */
typedef enum TOCPM_TOCC7OE_enum
{
    TOCPM_TOCC7OE_CLEAR_gc = (0x00), /* Timer Output Compare Channel 7 Output Enable - CLEAR */
    TOCPM_TOCC7OE_SET_gc   = (0x80), /* Timer Output Compare Channel 7 Output Enable - SET */
} TOCPM_TOCC7OE_t;

/* Timer Output Compare Channel 6 Output Enable */
typedef enum TOCPM_TOCC6OE_enum
{
    TOCPM_TOCC6OE_CLEAR_gc = (0x00), /* Timer Output Compare Channel 6 Output Enable - CLEAR */
    TOCPM_TOCC6OE_SET_gc   = (0x40), /* Timer Output Compare Channel 6 Output Enable - SET */
} TOCPM_TOCC6OE_t;

/* Timer Output Compare Channel 5 Output Enable */
typedef enum TOCPM_TOCC5OE_enum
{
    TOCPM_TOCC5OE_CLEAR_gc = (0x00), /* Timer Output Compare Channel 5 Output Enable - CLEAR */
    TOCPM_TOCC5OE_SET_gc   = (0x20), /* Timer Output Compare Channel 5 Output Enable - SET */
} TOCPM_TOCC5OE_t;

/* Timer Output Compare Channel 4 Output Enable */
typedef enum TOCPM_TOCC4OE_enum
{
    TOCPM_TOCC4OE_CLEAR_gc = (0x00), /* Timer Output Compare Channel 4 Output Enable - CLEAR */
    TOCPM_TOCC4OE_SET_gc   = (0x10), /* Timer Output Compare Channel 4 Output Enable - SET */
} TOCPM_TOCC4OE_t;

/* Timer Output Compare Channel 3 Output Enable */
typedef enum TOCPM_TOCC3OE_enum
{
    TOCPM_TOCC3OE_CLEAR_gc = (0x00), /* Timer Output Compare Channel 3 Output Enable - CLEAR */
    TOCPM_TOCC3OE_SET_gc   = (0x08), /* Timer Output Compare Channel 3 Output Enable - SET */
} TOCPM_TOCC3OE_t;

/* Timer Output Compare Channel 2 Output Enable */
typedef enum TOCPM_TOCC2OE_enum
{
    TOCPM_TOCC2OE_CLEAR_gc = (0x00), /* Timer Output Compare Channel 2 Output Enable - CLEAR */
    TOCPM_TOCC2OE_SET_gc   = (0x04), /* Timer Output Compare Channel 2 Output Enable - SET */
} TOCPM_TOCC2OE_t;

/* Timer Output Compare Channel 1 Output Enable */
typedef enum TOCPM_TOCC1OE_enum
{
    TOCPM_TOCC1OE_CLEAR_gc = (0x00), /* Timer Output Compare Channel 1 Output Enable - CLEAR */
    TOCPM_TOCC1OE_SET_gc   = (0x02), /* Timer Output Compare Channel 1 Output Enable - SET */
} TOCPM_TOCC1OE_t;

/* Timer Output Compare Channel 0 Output Enable */
typedef enum TOCPM_TOCC0OE_enum
{
    TOCPM_TOCC0OE_CLEAR_gc = (0x00), /* Timer Output Compare Channel 0 Output Enable - CLEAR */
    TOCPM_TOCC0OE_SET_gc   = (0x01), /* Timer Output Compare Channel 0 Output Enable - SET */
} TOCPM_TOCC0OE_t;

/*
--------------------------------------------------------------------------------
ADC - Analog-to-Digital Converter
--------------------------------------------------------------------------------
*/

typedef struct ADC_struct
{
    register8_t rsv_0x00[120]; /* RESERVED REGISTER BLOCK */
    _REGISTER16 (ADC);         /* ADC Data Register  Bytes */
    register8_t rsv_0x79;      /* RESERVED REGISTER */
    register8_t ADCSRA;        /* The ADC Control and Status register */
    register8_t ADCSRB;        /* ADC Control and Status Register B */
    register8_t ADMUXA;        /* The ADC multiplexer Selection Register A */
    register8_t ADMUXB;        /* The ADC multiplexer Selection Register B */
    register8_t DIDR0;         /* Digital Input Disable Register 0 */
    register8_t DIDR1;         /* Digital Input Disable Register 1 */
    register8_t rsv_0x80[94];  /* RESERVED REGISTER BLOCK */
    register8_t DIDR2;         /* Digital Input Disable Register 2 */
    register8_t DIDR3;         /* Digital Input Disable Register 2 */
} ADC_t;


/* Reference Selection Bit */
typedef enum ADC_REFS_enum
{
    ADC_REFS_CLEAR_gc = (0x00), /* Reference Selection Bit - CLEAR */
    ADC_REFS_SET_gc   = (0x20), /* Reference Selection Bit - SET */
} ADC_REFS_t;

/* Analog Channel Selection Bit 5 */
typedef enum ADC_MUX5_enum
{
    ADC_MUX5_CLEAR_gc = (0x00), /* Analog Channel Selection Bit 5 - CLEAR */
    ADC_MUX5_SET_gc   = (0x01), /* Analog Channel Selection Bit 5 - SET */
} ADC_MUX5_t;

/* ADC Enable */
typedef enum ADC_ADEN_enum
{
    ADC_ADEN_CLEAR_gc = (0x00), /* ADC Enable - CLEAR */
    ADC_ADEN_SET_gc   = (0x80), /* ADC Enable - SET */
} ADC_ADEN_t;

