stevenj/avr-libc3/include/avr/io/attiny828.h
/* ADC Start Conversion */
typedef enum ADC_ADSC_enum
{
    ADC_ADSC_CLEAR_gc = (0x00), /* ADC Start Conversion - CLEAR */
    ADC_ADSC_SET_gc   = (0x40), /* ADC Start Conversion - SET */
} ADC_ADSC_t;

/* ADC Auto Trigger Enable */
typedef enum ADC_ADATE_enum
{
    ADC_ADATE_CLEAR_gc = (0x00), /* ADC Auto Trigger Enable - CLEAR */
    ADC_ADATE_SET_gc   = (0x20), /* ADC Auto Trigger Enable - SET */
} ADC_ADATE_t;

/* ADC Interrupt Flag */
typedef enum ADC_ADIF_enum
{
    ADC_ADIF_CLEAR_gc = (0x00), /* ADC Interrupt Flag - CLEAR */
    ADC_ADIF_SET_gc   = (0x10), /* ADC Interrupt Flag - SET */
} ADC_ADIF_t;

/* ADC Interrupt Enable */
typedef enum ADC_ADIE_enum
{
    ADC_ADIE_CLEAR_gc = (0x00), /* ADC Interrupt Enable - CLEAR */
    ADC_ADIE_SET_gc   = (0x08), /* ADC Interrupt Enable - SET */
} ADC_ADIE_t;

/* ADC Prescaler Select Bits */
typedef enum ADC_ADPS_enum
{
    ADC_ADPS_VAL_0x00_gc = (0x00), /* 2 */
    ADC_ADPS_VAL_0x01_gc = (0x01), /* 2 */
    ADC_ADPS_VAL_0x02_gc = (0x02), /* 4 */
    ADC_ADPS_VAL_0x03_gc = (0x03), /* 8 */
    ADC_ADPS_VAL_0x04_gc = (0x04), /* 16 */
    ADC_ADPS_VAL_0x05_gc = (0x05), /* 32 */
    ADC_ADPS_VAL_0x06_gc = (0x06), /* 64 */
    ADC_ADPS_VAL_0x07_gc = (0x07), /* 128 */
} ADC_ADPS_t;

/* ADC Control and Status Register B-ADLAR */
typedef enum ADC_ADLAR_enum
{
    ADC_ADLAR_CLEAR_gc = (0x00), /* ADC Control and Status Register B-ADLAR - CLEAR */
    ADC_ADLAR_SET_gc   = (0x08), /* ADC Control and Status Register B-ADLAR - SET */
} ADC_ADLAR_t;

/* ADC Auto Trigger Sources */
typedef enum ADC_ADTS_enum
{
    ADC_ADTS_VAL_0x00_gc = (0x00), /* Free Running mode */
    ADC_ADTS_VAL_0x01_gc = (0x01), /* Analog Comparator */
    ADC_ADTS_VAL_0x02_gc = (0x02), /* External Interrupt Request 0 */
    ADC_ADTS_VAL_0x03_gc = (0x03), /* Timer/Counter0 Compare Match A */
    ADC_ADTS_VAL_0x04_gc = (0x04), /* Timer/Counter0 Overflow */
    ADC_ADTS_VAL_0x05_gc = (0x05), /* Timer/Counter1 Compare Match B */
    ADC_ADTS_VAL_0x06_gc = (0x06), /* Timer/Counter1 Overflow */
    ADC_ADTS_VAL_0x07_gc = (0x07), /* Timer/Counter1 Capture Event */
} ADC_ADTS_t;

/* ADC27 Digital input Disable */
typedef enum ADC_ADC27D_enum
{
    ADC_ADC27D_CLEAR_gc = (0x00), /* ADC27 Digital input Disable - CLEAR */
    ADC_ADC27D_SET_gc   = (0x08), /* ADC27 Digital input Disable - SET */
} ADC_ADC27D_t;

/* ADC26 Digital input Disable */
typedef enum ADC_ADC26D_enum
{
    ADC_ADC26D_CLEAR_gc = (0x00), /* ADC26 Digital input Disable - CLEAR */
    ADC_ADC26D_SET_gc   = (0x04), /* ADC26 Digital input Disable - SET */
} ADC_ADC26D_t;

/* ADC25 Digital input Disable */
typedef enum ADC_ADC25D_enum
{
    ADC_ADC25D_CLEAR_gc = (0x00), /* ADC25 Digital input Disable - CLEAR */
    ADC_ADC25D_SET_gc   = (0x02), /* ADC25 Digital input Disable - SET */
} ADC_ADC25D_t;

/* ADC24 Digital input Disable */
typedef enum ADC_ADC24D_enum
{
    ADC_ADC24D_CLEAR_gc = (0x00), /* ADC24 Digital input Disable - CLEAR */
    ADC_ADC24D_SET_gc   = (0x01), /* ADC24 Digital input Disable - SET */
} ADC_ADC24D_t;

/* ADC23 Digital input Disable */
typedef enum ADC_ADC23D_enum
{
    ADC_ADC23D_CLEAR_gc = (0x00), /* ADC23 Digital input Disable - CLEAR */
    ADC_ADC23D_SET_gc   = (0x80), /* ADC23 Digital input Disable - SET */
} ADC_ADC23D_t;

/* ADC22 Digital input Disable */
typedef enum ADC_ADC22D_enum
{
    ADC_ADC22D_CLEAR_gc = (0x00), /* ADC22 Digital input Disable - CLEAR */
    ADC_ADC22D_SET_gc   = (0x40), /* ADC22 Digital input Disable - SET */
} ADC_ADC22D_t;

/* ADC21 Digital input Disable */
typedef enum ADC_ADC21D_enum
{
    ADC_ADC21D_CLEAR_gc = (0x00), /* ADC21 Digital input Disable - CLEAR */
    ADC_ADC21D_SET_gc   = (0x20), /* ADC21 Digital input Disable - SET */
} ADC_ADC21D_t;

/* ADC20 Digital input Disable */
typedef enum ADC_ADC20D_enum
{
    ADC_ADC20D_CLEAR_gc = (0x00), /* ADC20 Digital input Disable - CLEAR */
    ADC_ADC20D_SET_gc   = (0x10), /* ADC20 Digital input Disable - SET */
} ADC_ADC20D_t;

/* ADC19 Digital input Disable */
typedef enum ADC_ADC19D_enum
{
    ADC_ADC19D_CLEAR_gc = (0x00), /* ADC19 Digital input Disable - CLEAR */
    ADC_ADC19D_SET_gc   = (0x08), /* ADC19 Digital input Disable - SET */
} ADC_ADC19D_t;

/* ADC18 Digital input Disable */
typedef enum ADC_ADC18D_enum
{
    ADC_ADC18D_CLEAR_gc = (0x00), /* ADC18 Digital input Disable - CLEAR */
    ADC_ADC18D_SET_gc   = (0x04), /* ADC18 Digital input Disable - SET */
} ADC_ADC18D_t;

/* ADC17 Digital input Disable */
typedef enum ADC_ADC17D_enum
{
    ADC_ADC17D_CLEAR_gc = (0x00), /* ADC17 Digital input Disable - CLEAR */
    ADC_ADC17D_SET_gc   = (0x02), /* ADC17 Digital input Disable - SET */
} ADC_ADC17D_t;

/* ADC16 Digital input Disable */
typedef enum ADC_ADC16D_enum
{
    ADC_ADC16D_CLEAR_gc = (0x00), /* ADC16 Digital input Disable - CLEAR */
    ADC_ADC16D_SET_gc   = (0x01), /* ADC16 Digital input Disable - SET */
} ADC_ADC16D_t;

/* ADC15 Digital input Disable */
typedef enum ADC_ADC15D_enum
{
    ADC_ADC15D_CLEAR_gc = (0x00), /* ADC15 Digital input Disable - CLEAR */
    ADC_ADC15D_SET_gc   = (0x80), /* ADC15 Digital input Disable - SET */
} ADC_ADC15D_t;

/* ADC14 Digital input Disable */
typedef enum ADC_ADC14D_enum
{
    ADC_ADC14D_CLEAR_gc = (0x00), /* ADC14 Digital input Disable - CLEAR */
    ADC_ADC14D_SET_gc   = (0x40), /* ADC14 Digital input Disable - SET */
} ADC_ADC14D_t;

/* ADC13 Digital input Disable */
typedef enum ADC_ADC13D_enum
{
    ADC_ADC13D_CLEAR_gc = (0x00), /* ADC13 Digital input Disable - CLEAR */
    ADC_ADC13D_SET_gc   = (0x20), /* ADC13 Digital input Disable - SET */
} ADC_ADC13D_t;

/* ADC12 Digital input Disable */
typedef enum ADC_ADC12D_enum
{
    ADC_ADC12D_CLEAR_gc = (0x00), /* ADC12 Digital input Disable - CLEAR */
    ADC_ADC12D_SET_gc   = (0x10), /* ADC12 Digital input Disable - SET */
} ADC_ADC12D_t;

/* ADC11 Digital input Disable */
typedef enum ADC_ADC11D_enum
{
    ADC_ADC11D_CLEAR_gc = (0x00), /* ADC11 Digital input Disable - CLEAR */
    ADC_ADC11D_SET_gc   = (0x08), /* ADC11 Digital input Disable - SET */
} ADC_ADC11D_t;

/* ADC10 Digital input Disable */
typedef enum ADC_ADC10D_enum
{
    ADC_ADC10D_CLEAR_gc = (0x00), /* ADC10 Digital input Disable - CLEAR */
    ADC_ADC10D_SET_gc   = (0x04), /* ADC10 Digital input Disable - SET */
} ADC_ADC10D_t;

/* ADC9 Digital input Disable */
typedef enum ADC_ADC9D_enum
{
    ADC_ADC9D_CLEAR_gc = (0x00), /* ADC9 Digital input Disable - CLEAR */
    ADC_ADC9D_SET_gc   = (0x02), /* ADC9 Digital input Disable - SET */
} ADC_ADC9D_t;

/* ADC8 Digital input Disable */
typedef enum ADC_ADC8D_enum
{
    ADC_ADC8D_CLEAR_gc = (0x00), /* ADC8 Digital input Disable - CLEAR */
    ADC_ADC8D_SET_gc   = (0x01), /* ADC8 Digital input Disable - SET */
} ADC_ADC8D_t;

