stevenj/avr-libc3/include/avr/io/attiny828.h
/* Stop Bit Select */
typedef enum USART_USBS_enum
{
    USART_USBS_VAL_0x00_gc = (0x00<<3), /* 1-bit */
    USART_USBS_VAL_0x01_gc = (0x01<<3), /* 2-bit */
} USART_USBS_t;

/* Character Size */
#define USART_UCSRC_UCSZ_gc(x) ((x<<1) & 0x06)

/* Clock Polarity */
typedef enum USART_UCPOL_enum
{
    USART_UCPOL_CLEAR_gc = (0x00), /* Clock Polarity - CLEAR */
    USART_UCPOL_SET_gc   = (0x01), /* Clock Polarity - SET */
} USART_UCPOL_t;

/* USART RX Start Interrupt Enable */
typedef enum USART_RXSIE_enum
{
    USART_RXSIE_CLEAR_gc = (0x00), /* USART RX Start Interrupt Enable - CLEAR */
    USART_RXSIE_SET_gc   = (0x80), /* USART RX Start Interrupt Enable - SET */
} USART_RXSIE_t;

/* USART RX Start Flag */
typedef enum USART_RXS_enum
{
    USART_RXS_CLEAR_gc = (0x00), /* USART RX Start Flag - CLEAR */
    USART_RXS_SET_gc   = (0x40), /* USART RX Start Flag - SET */
} USART_RXS_t;

/* USART RX Start Frame Detection Enable */
typedef enum USART_SFDE_enum
{
    USART_SFDE_CLEAR_gc = (0x00), /* USART RX Start Frame Detection Enable - CLEAR */
    USART_SFDE_SET_gc   = (0x20), /* USART RX Start Frame Detection Enable - SET */
} USART_SFDE_t;
/*
================================================================================
IO Module Instances. Mapped to memory.
================================================================================
*/

#define SPI     (*(SPI_t *) 0x0000)     /* Serial Peripheral Interface */
#define PORTA   (*(PORTA_t *) 0x0000)   /* I/O Port */
#define PORTB   (*(PORTB_t *) 0x0000)   /* I/O Port */
#define PORTC   (*(PORTC_t *) 0x0000)   /* I/O Port */
#define PORTD   (*(PORTD_t *) 0x0000)   /* I/O Port */
#define CPU     (*(CPU_t *) 0x0000)     /* CPU Registers */
#define TC0     (*(TC0_t *) 0x0000)     /* Timer/Counter, 8-bit */
#define TC1     (*(TC1_t *) 0x0000)     /* Timer/Counter, 16-bit */
#define TOCPM   (*(TOCPM_t *) 0x0000)   /* Timer/Counter Output Compare Pin */
#define ADC     (*(ADC_t *) 0x0000)     /* Analog-to-Digital Converter */
#define AC      (*(AC_t *) 0x0000)      /* Analog Comparator */
#define EXINT   (*(EXINT_t *) 0x0000)   /* External Interrupts */
#define WDT     (*(WDT_t *) 0x0000)     /* Watchdog Timer */
#define EEPROM  (*(EEPROM_t *) 0x0000)  /* EEPROM */
#define TWI     (*(TWI_t *) 0x0000)     /* Two Wire Serial Interface */
#define USART   (*(USART_t *) 0x0000)   /* USART */
#define FUSE    (*(FUSE_t *) 0x0000)    /* Fuses */
#define LOCKBIT (*(LOCKBIT_t *) 0x0000) /* Lockbits */
#else
/*
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
ASM LANGUAGE - ONLY
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
*/


/*
--------------------------------------------------------------------------------
FUSE - Fuses
--------------------------------------------------------------------------------
*/


/* Select boot size */
#define FUSE_BOOTSZ_128W_0F80_gc  (0x03<<1) /* Boot Flash size=128 words Boot address=$0F80 */
#define FUSE_BOOTSZ_256W_0F00_gc  (0x02<<1) /* Boot Flash size=256 words Boot address=$0F00 */
#define FUSE_BOOTSZ_512W_0E00_gc  (0x01<<1) /* Boot Flash size=512 words Boot address=$0E00 */
#define FUSE_BOOTSZ_1024W_0C00_gc (0x00<<1) /* Boot Flash size=1024 words Boot address=$0C00 */


/* Boot Reset vector Enabled */
#define FUSE_BOOTRST_CLEAR_gc (0x00) /* Boot Reset vector Enabled - CLEAR */
#define FUSE_BOOTRST_SET_gc   (0x01) /* Boot Reset vector Enabled - SET */


/* BOD mode of operation when the device is in sleep mode */
#define FUSE_BODPD_BOD_SAMPLED_gc  (0x01<<6) /* Sampled */
#define FUSE_BODPD_BOD_ENABLED_gc  (0x02<<6) /* Enabled */
#define FUSE_BODPD_BOD_DISABLED_gc (0x03<<6) /* Disabled */


/* BOD mode of operation when the device is active or idle */
#define FUSE_BODACT_BOD_SAMPLED_gc  (0x01<<4) /* Sampled */
#define FUSE_BODACT_BOD_ENABLED_gc  (0x02<<4) /* Enabled */
#define FUSE_BODACT_BOD_DISABLED_gc (0x03<<4) /* Disabled */


/* Reset Disabled (Enable PC6 as i/o pin)] */
#define FUSE_RSTDISBL_CLEAR_gc (0x00) /* Reset Disabled (Enable PC6 as i/o pin)] - CLEAR */
#define FUSE_RSTDISBL_SET_gc   (0x80) /* Reset Disabled (Enable PC6 as i/o pin)] - SET */


/* Debug Wire enable */
#define FUSE_DWEN_CLEAR_gc (0x00) /* Debug Wire enable - CLEAR */
#define FUSE_DWEN_SET_gc   (0x40) /* Debug Wire enable - SET */


/* Serial program downloading (SPI) enabled */
#define FUSE_SPIEN_CLEAR_gc (0x00) /* Serial program downloading (SPI) enabled - CLEAR */
#define FUSE_SPIEN_SET_gc   (0x20) /* Serial program downloading (SPI) enabled - SET */


/* Watch-dog Timer always on */
#define FUSE_WDTON_CLEAR_gc (0x00) /* Watch-dog Timer always on - CLEAR */
#define FUSE_WDTON_SET_gc   (0x10) /* Watch-dog Timer always on - SET */


/* Preserve EEPROM through the Chip Erase cycle */
#define FUSE_EESAVE_CLEAR_gc (0x00) /* Preserve EEPROM through the Chip Erase cycle - CLEAR */
#define FUSE_EESAVE_SET_gc   (0x08) /* Preserve EEPROM through the Chip Erase cycle - SET */


/* Brown-out Detector trigger level */
#define FUSE_BODLEVEL_DISABLED_gc (0x07) /* Brown-out detection disabled */
#define FUSE_BODLEVEL_4V3_gc      (0x04) /* Brown-out detection at VCC=4.3 V */
#define FUSE_BODLEVEL_2V7_gc      (0x05) /* Brown-out detection at VCC=2.7 V */
#define FUSE_BODLEVEL_1V8_gc      (0x06) /* Brown-out detection at VCC=1.8 V */


/* Divide clock by 8 internally */
#define FUSE_CKDIV8_CLEAR_gc (0x00) /* Divide clock by 8 internally - CLEAR */
#define FUSE_CKDIV8_SET_gc   (0x80) /* Divide clock by 8 internally - SET */


/* Clock output on PORTB0 */
#define FUSE_CKOUT_CLEAR_gc (0x00) /* Clock output on PORTB0 - CLEAR */
#define FUSE_CKOUT_SET_gc   (0x40) /* Clock output on PORTB0 - SET */


/* Select Clock Source */
#define FUSE_SUT_CKSEL_EXTCLK_6CK_14CK_0MS_gc           (0x00) /* Ext. Clock; Start-up time PWRDWN/RESET: 6 + 14 CK + 0 ms */
/* WARNING: FUSE_SUT_CKSEL_EXTCLK_6CK_14CK_0MS_gc ALREADY DEFINED as '(0x00)' NOT '(0x01)' */
#define FUSE_SUT_CKSEL_EXTCLK_6CK_14CK_4MS1_gc          (0x10) /* Ext. Clock; Start-up time PWRDWN/RESET: 6 + 14 CK + 4.1 ms */
/* WARNING: FUSE_SUT_CKSEL_EXTCLK_6CK_14CK_4MS1_gc ALREADY DEFINED as '(0x10)' NOT '(0x11)' */
#define FUSE_SUT_CKSEL_EXTCLK_6CK_14CK_65MS_gc          (0x20) /* Ext. Clock; Start-up time PWRDWN/RESET: 6 + 14 CK + 65 ms */
/* WARNING: FUSE_SUT_CKSEL_EXTCLK_6CK_14CK_65MS_gc ALREADY DEFINED as '(0x20)' NOT '(0x30)' */
/* WARNING: FUSE_SUT_CKSEL_EXTCLK_6CK_14CK_65MS_gc ALREADY DEFINED as '(0x20)' NOT '(0x21)' */
/* WARNING: FUSE_SUT_CKSEL_EXTCLK_6CK_14CK_65MS_gc ALREADY DEFINED as '(0x20)' NOT '(0x31)' */
#define FUSE_SUT_CKSEL_INTRCOSC_8MHZ_6CK_14CK_0MS_gc    (0x02) /* Int. RC Osc. 8 MHz; Start-up time PWRDWN/RESET: 6 + 14 CK + 0 ms */
#define FUSE_SUT_CKSEL_INTRCOSC_8MHZ_6CK_14CK_4MS1_gc   (0x12) /* Int. RC Osc. 8 MHz; Start-up time PWRDWN/RESET: 6 + 14 CK + 4.1 ms */
#define FUSE_SUT_CKSEL_INTRCOSC_8MHZ_6CK_14CK_65MS_gc   (0x22) /* Int. RC Osc. 8 MHz; Start-up time PWRDWN/RESET: 6 + 14 CK + 65 ms */
/* WARNING: FUSE_SUT_CKSEL_INTRCOSC_8MHZ_6CK_14CK_65MS_gc ALREADY DEFINED as '(0x22)' NOT '(0x32)' */
#define FUSE_SUT_CKSEL_INTULPOSC_32KHZ_6CK_14CK_0MS_gc  (0x03) /* Int. ULP Osc. 32kHz; Start-up time PWRDWN/RESET: 6 + 14 CK + 0 ms */
#define FUSE_SUT_CKSEL_INTULPOSC_32KHZ_6CK_14CK_4MS1_gc (0x13) /* Int. ULP Osc. 32kHz; Start-up time PWRDWN/RESET: 6 + 14 CK + 4.1 ms */
#define FUSE_SUT_CKSEL_INTULPOSC_32KHZ_6CK_14CK_65MS_gc (0x23) /* Int. ULP Osc. 32kHz; Start-up time PWRDWN/RESET: 6 + 14 CK + 65 ms */
/* WARNING: FUSE_SUT_CKSEL_INTULPOSC_32KHZ_6CK_14CK_65MS_gc ALREADY DEFINED as '(0x23)' NOT '(0x33)' */


