stevenj/avr-libc3/include/avr/io/attiny828.h
/* Timer Output Compare Channel 4 Output Enable */
#define TOCPM_TOCC4OE_CLEAR_gc (0x00) /* Timer Output Compare Channel 4 Output Enable - CLEAR */
#define TOCPM_TOCC4OE_SET_gc   (0x10) /* Timer Output Compare Channel 4 Output Enable - SET */


/* Timer Output Compare Channel 3 Output Enable */
#define TOCPM_TOCC3OE_CLEAR_gc (0x00) /* Timer Output Compare Channel 3 Output Enable - CLEAR */
#define TOCPM_TOCC3OE_SET_gc   (0x08) /* Timer Output Compare Channel 3 Output Enable - SET */


/* Timer Output Compare Channel 2 Output Enable */
#define TOCPM_TOCC2OE_CLEAR_gc (0x00) /* Timer Output Compare Channel 2 Output Enable - CLEAR */
#define TOCPM_TOCC2OE_SET_gc   (0x04) /* Timer Output Compare Channel 2 Output Enable - SET */


/* Timer Output Compare Channel 1 Output Enable */
#define TOCPM_TOCC1OE_CLEAR_gc (0x00) /* Timer Output Compare Channel 1 Output Enable - CLEAR */
#define TOCPM_TOCC1OE_SET_gc   (0x02) /* Timer Output Compare Channel 1 Output Enable - SET */


/* Timer Output Compare Channel 0 Output Enable */
#define TOCPM_TOCC0OE_CLEAR_gc (0x00) /* Timer Output Compare Channel 0 Output Enable - CLEAR */
#define TOCPM_TOCC0OE_SET_gc   (0x01) /* Timer Output Compare Channel 0 Output Enable - SET */


/*
--------------------------------------------------------------------------------
ADC - Analog-to-Digital Converter
--------------------------------------------------------------------------------
*/


/* Reference Selection Bit */
#define ADC_REFS_CLEAR_gc (0x00) /* Reference Selection Bit - CLEAR */
#define ADC_REFS_SET_gc   (0x20) /* Reference Selection Bit - SET */


/* Analog Channel Selection Bit 5 */
#define ADC_MUX5_CLEAR_gc (0x00) /* Analog Channel Selection Bit 5 - CLEAR */
#define ADC_MUX5_SET_gc   (0x01) /* Analog Channel Selection Bit 5 - SET */


/* ADC Enable */
#define ADC_ADEN_CLEAR_gc (0x00) /* ADC Enable - CLEAR */
#define ADC_ADEN_SET_gc   (0x80) /* ADC Enable - SET */


/* ADC Start Conversion */
#define ADC_ADSC_CLEAR_gc (0x00) /* ADC Start Conversion - CLEAR */
#define ADC_ADSC_SET_gc   (0x40) /* ADC Start Conversion - SET */


/* ADC Auto Trigger Enable */
#define ADC_ADATE_CLEAR_gc (0x00) /* ADC Auto Trigger Enable - CLEAR */
#define ADC_ADATE_SET_gc   (0x20) /* ADC Auto Trigger Enable - SET */


/* ADC Interrupt Flag */
#define ADC_ADIF_CLEAR_gc (0x00) /* ADC Interrupt Flag - CLEAR */
#define ADC_ADIF_SET_gc   (0x10) /* ADC Interrupt Flag - SET */


/* ADC Interrupt Enable */
#define ADC_ADIE_CLEAR_gc (0x00) /* ADC Interrupt Enable - CLEAR */
#define ADC_ADIE_SET_gc   (0x08) /* ADC Interrupt Enable - SET */


/* ADC Prescaler Select Bits */
#define ADC_ADPS_VAL_0x00_gc (0x00) /* 2 */
#define ADC_ADPS_VAL_0x01_gc (0x01) /* 2 */
#define ADC_ADPS_VAL_0x02_gc (0x02) /* 4 */
#define ADC_ADPS_VAL_0x03_gc (0x03) /* 8 */
#define ADC_ADPS_VAL_0x04_gc (0x04) /* 16 */
#define ADC_ADPS_VAL_0x05_gc (0x05) /* 32 */
#define ADC_ADPS_VAL_0x06_gc (0x06) /* 64 */
#define ADC_ADPS_VAL_0x07_gc (0x07) /* 128 */


/* ADC Control and Status Register B-ADLAR */
#define ADC_ADLAR_CLEAR_gc (0x00) /* ADC Control and Status Register B-ADLAR - CLEAR */
#define ADC_ADLAR_SET_gc   (0x08) /* ADC Control and Status Register B-ADLAR - SET */


/* ADC Auto Trigger Sources */
#define ADC_ADTS_VAL_0x00_gc (0x00) /* Free Running mode */
#define ADC_ADTS_VAL_0x01_gc (0x01) /* Analog Comparator */
#define ADC_ADTS_VAL_0x02_gc (0x02) /* External Interrupt Request 0 */
#define ADC_ADTS_VAL_0x03_gc (0x03) /* Timer/Counter0 Compare Match A */
#define ADC_ADTS_VAL_0x04_gc (0x04) /* Timer/Counter0 Overflow */
#define ADC_ADTS_VAL_0x05_gc (0x05) /* Timer/Counter1 Compare Match B */
#define ADC_ADTS_VAL_0x06_gc (0x06) /* Timer/Counter1 Overflow */
#define ADC_ADTS_VAL_0x07_gc (0x07) /* Timer/Counter1 Capture Event */


/* ADC27 Digital input Disable */
#define ADC_ADC27D_CLEAR_gc (0x00) /* ADC27 Digital input Disable - CLEAR */
#define ADC_ADC27D_SET_gc   (0x08) /* ADC27 Digital input Disable - SET */


/* ADC26 Digital input Disable */
#define ADC_ADC26D_CLEAR_gc (0x00) /* ADC26 Digital input Disable - CLEAR */
#define ADC_ADC26D_SET_gc   (0x04) /* ADC26 Digital input Disable - SET */


/* ADC25 Digital input Disable */
#define ADC_ADC25D_CLEAR_gc (0x00) /* ADC25 Digital input Disable - CLEAR */
#define ADC_ADC25D_SET_gc   (0x02) /* ADC25 Digital input Disable - SET */


/* ADC24 Digital input Disable */
#define ADC_ADC24D_CLEAR_gc (0x00) /* ADC24 Digital input Disable - CLEAR */
#define ADC_ADC24D_SET_gc   (0x01) /* ADC24 Digital input Disable - SET */


/* ADC23 Digital input Disable */
#define ADC_ADC23D_CLEAR_gc (0x00) /* ADC23 Digital input Disable - CLEAR */
#define ADC_ADC23D_SET_gc   (0x80) /* ADC23 Digital input Disable - SET */


/* ADC22 Digital input Disable */
#define ADC_ADC22D_CLEAR_gc (0x00) /* ADC22 Digital input Disable - CLEAR */
#define ADC_ADC22D_SET_gc   (0x40) /* ADC22 Digital input Disable - SET */


/* ADC21 Digital input Disable */
#define ADC_ADC21D_CLEAR_gc (0x00) /* ADC21 Digital input Disable - CLEAR */
#define ADC_ADC21D_SET_gc   (0x20) /* ADC21 Digital input Disable - SET */


/* ADC20 Digital input Disable */
#define ADC_ADC20D_CLEAR_gc (0x00) /* ADC20 Digital input Disable - CLEAR */
#define ADC_ADC20D_SET_gc   (0x10) /* ADC20 Digital input Disable - SET */


/* ADC19 Digital input Disable */
#define ADC_ADC19D_CLEAR_gc (0x00) /* ADC19 Digital input Disable - CLEAR */
#define ADC_ADC19D_SET_gc   (0x08) /* ADC19 Digital input Disable - SET */


/* ADC18 Digital input Disable */
#define ADC_ADC18D_CLEAR_gc (0x00) /* ADC18 Digital input Disable - CLEAR */
#define ADC_ADC18D_SET_gc   (0x04) /* ADC18 Digital input Disable - SET */


/* ADC17 Digital input Disable */
#define ADC_ADC17D_CLEAR_gc (0x00) /* ADC17 Digital input Disable - CLEAR */
#define ADC_ADC17D_SET_gc   (0x02) /* ADC17 Digital input Disable - SET */


/* ADC16 Digital input Disable */
#define ADC_ADC16D_CLEAR_gc (0x00) /* ADC16 Digital input Disable - CLEAR */
#define ADC_ADC16D_SET_gc   (0x01) /* ADC16 Digital input Disable - SET */


/* ADC15 Digital input Disable */
#define ADC_ADC15D_CLEAR_gc (0x00) /* ADC15 Digital input Disable - CLEAR */
#define ADC_ADC15D_SET_gc   (0x80) /* ADC15 Digital input Disable - SET */


