stevenj/avr-libc3/include/avr/io/attiny828.h
/* TOCPM - Timer/Counter Output Compare Pin (0x0000) */
#define TOCPM_BASE      _SFR_MEM8 (0x0000) /* TOCPM Base Address */
#define TOCPM_TOCPMCOE  _SFR_MEM8 (0x00E2) /* Timer Output Compare Pin Mux Channel Output Enable */
#define TOCPM_TOCPMSA0  _SFR_MEM8 (0x00E8) /* Timer Output Compare Pin Mux Selection 0 */
#define TOCPM_TOCPMSA1  _SFR_MEM8 (0x00E9) /* Timer Output Compare Pin Mux Selection 1 */

/* ADC - Analog-to-Digital Converter (0x0000) */
#define ADC_BASE        _SFR_MEM16(0x0000) /* ADC Base Address */
#define ADC_ADC         _SFR_MEM16(0x0078) /* ADC Data Register  Bytes */
#define ADC_ADCL        _SFR_MEM8 (0x0078) /* ADC Data Register  Bytes LOW BYTE */
#define ADC_ADCH        _SFR_MEM8 (0x0079) /* ADC Data Register  Bytes HIGH BYTE */
#define ADC_ADCSRA      _SFR_MEM8 (0x007A) /* The ADC Control and Status register */
#define ADC_ADCSRB      _SFR_MEM8 (0x007B) /* ADC Control and Status Register B */
#define ADC_ADMUXA      _SFR_MEM8 (0x007C) /* The ADC multiplexer Selection Register A */
#define ADC_ADMUXB      _SFR_MEM8 (0x007D) /* The ADC multiplexer Selection Register B */
#define ADC_DIDR0       _SFR_MEM8 (0x007E) /* Digital Input Disable Register 0 */
#define ADC_DIDR1       _SFR_MEM8 (0x007F) /* Digital Input Disable Register 1 */
#define ADC_DIDR2       _SFR_MEM8 (0x00DE) /* Digital Input Disable Register 2 */
#define ADC_DIDR3       _SFR_MEM8 (0x00DF) /* Digital Input Disable Register 2 */

/* AC - Analog Comparator (0x0000) */
#define AC_BASE         _SFR_MEM8 (0x0000) /* AC Base Address */
#define AC_ACSRB        _SFR_MEM8 (0x004F) /* Analog Comparator Control And Status Register B */
#define AC_ACSRA        _SFR_MEM8 (0x0050) /* Analog Comparator Control And Status Register A */

/* EXINT - External Interrupts (0x0000) */
#define EXINT_BASE      _SFR_MEM8 (0x0000) /* EXINT Base Address */
#define EXINT_PCIFR     _SFR_MEM8 (0x003B) /* Pin Change Interrupt Flag Register */
#define EXINT_EIFR      _SFR_MEM8 (0x003C) /* External Interrupt Flag Register */
#define EXINT_EIMSK     _SFR_MEM8 (0x003D) /* External Interrupt Mask Register */
#define EXINT_PCICR     _SFR_MEM8 (0x0068) /* Pin Change Interrupt Control Register */
#define EXINT_EICRA     _SFR_MEM8 (0x0069) /* External Interrupt Control Register */
#define EXINT_PCMSK0    _SFR_MEM8 (0x006B) /* Pin Change Mask Register 0 */
#define EXINT_PCMSK1    _SFR_MEM8 (0x006C) /* Pin Change Mask Register 1 */
#define EXINT_PCMSK2    _SFR_MEM8 (0x006D) /* Pin Change Mask Register 2 */
#define EXINT_PCMSK3    _SFR_MEM8 (0x0073) /* Pin Change Mask Register 3 */

/* WDT - Watchdog Timer (0x0000) */
#define WDT_BASE        _SFR_MEM8 (0x0000) /* WDT Base Address */
#define WDT_WDTCSR      _SFR_MEM8 (0x0060) /* Watchdog Timer Control and Status Register */

/* EEPROM - EEPROM (0x0000) */
#define EEPROM_BASE     _SFR_MEM8 (0x0000) /* EEPROM Base Address */
#define EEPROM_EECR     _SFR_MEM8 (0x003F) /* EEPROM Control Register */
#define EEPROM_EEDR     _SFR_MEM8 (0x0040) /* EEPROM Data Register */
#define EEPROM_EEAR     _SFR_MEM8 (0x0041) /* EEPROM Read/Write Access */

/* TWI - Two Wire Serial Interface (0x0000) */
#define TWI_BASE        _SFR_MEM8 (0x0000) /* TWI Base Address */
#define TWI_TWSCRA      _SFR_MEM8 (0x00B8) /* TWI Slave Control Register A */
#define TWI_TWSCRB      _SFR_MEM8 (0x00B9) /* TWI Slave Control Register B */
#define TWI_TWSSRA      _SFR_MEM8 (0x00BA) /* TWI Slave Status Register A */
#define TWI_TWSAM       _SFR_MEM8 (0x00BB) /* TWI Slave Address Mask Register */
#define TWI_TWSA        _SFR_MEM8 (0x00BC) /* TWI Slave Address Register */
#define TWI_TWSD        _SFR_MEM8 (0x00BD) /* TWI Slave Data Register */

/* USART - USART (0x0000) */
#define USART_BASE      _SFR_MEM8 (0x0000) /* USART Base Address */
#define USART_UCSRA     _SFR_MEM8 (0x00C0) /* USART Control and Status Register A */
#define USART_UCSRB     _SFR_MEM8 (0x00C1) /* USART Control and Status Register B */
#define USART_UCSRC     _SFR_MEM8 (0x00C2) /* USART Control and Status Register C */
#define USART_UCSRD     _SFR_MEM8 (0x00C3) /* USART Control and Status Register D */
#define USART_UBRR      _SFR_MEM16(0x00C4) /* USART Baud Rate Register  Bytes */
#define USART_UBRRL     _SFR_MEM8 (0x00C4) /* USART Baud Rate Register  Bytes LOW BYTE */
#define USART_UBRRH     _SFR_MEM8 (0x00C5) /* USART Baud Rate Register  Bytes HIGH BYTE */
#define USART_UDR       _SFR_MEM8 (0x00C6) /* USART I/O Data Register */

/* FUSE - Fuses (0x0000) */
#define FUSE_BASE       _SFR_MEM8 (0x0000) /* FUSE Base Address */
#define FUSE_LOW        _SFR_MEM8 (0x0000) 
#define FUSE_HIGH       _SFR_MEM8 (0x0001) 
#define FUSE_EXTENDED   _SFR_MEM8 (0x0002) 

/* LOCKBIT - Lockbits (0x0000) */
#define LOCKBIT_BASE    _SFR_MEM8 (0x0000) /* LOCKBIT Base Address */
#define LOCKBIT_LOCKBIT _SFR_MEM8 (0x0000) 
/* avr-libc typedef for avr/fuse.h */
typedef FUSE_t NVM_FUSES_t;

/*
================================================================================
Interrupt Vector Definitions
================================================================================
*/

/* Vector 0 is the reset vector */
#define None_RESET_vect_num        (0)                 
#define None_RESET_vect            _VECTOR(0)          /* External Pin, Power-on Reset, Brown-out Reset and Watchdog Reset */
#define None_INT0_vect_num         (1)                 
#define None_INT0_vect             _VECTOR(1)          /* External Interrupt Request 0 */
#define None_INT1_vect_num         (2)                 
#define None_INT1_vect             _VECTOR(2)          /* External Interrupt Request 1 */
#define None_PCINT0_vect_num       (3)                 
#define None_PCINT0_vect           _VECTOR(3)          /* Pin Change Interrupt Request 0 */
#define None_PCINT1_vect_num       (4)                 
#define None_PCINT1_vect           _VECTOR(4)          /* Pin Change Interrupt Request 1 */
#define None_PCINT2_vect_num       (5)                 
#define None_PCINT2_vect           _VECTOR(5)          /* Pin Change Interrupt Request 2 */
#define None_PCINT3_vect_num       (6)                 
#define None_PCINT3_vect           _VECTOR(6)          /* Pin Change Interrupt Request 3 */
#define None_WDT_vect_num          (7)                 
#define None_WDT_vect              _VECTOR(7)          /* Watchdog Time-out Interrupt */
#define None_TIMER1_CAPT_vect_num  (8)                 
#define None_TIMER1_CAPT_vect      _VECTOR(8)          /* Timer/Counter1 Capture Event */
#define None_TIMER1_COMPA_vect_num (9)                 
#define None_TIMER1_COMPA_vect     _VECTOR(9)          /* Timer/Counter1 Compare Match A */
#define None_TIMER1_COMPB_vect_num (10)                
#define None_TIMER1_COMPB_vect     _VECTOR(10)         /* Timer/Counter1 Compare Match B */
#define None_TIMER1_OVF_vect_num   (11)                
#define None_TIMER1_OVF_vect       _VECTOR(11)         /* Timer/Counter1 Overflow */
#define None_TIMER0_COMPA_vect_num (12)                
#define None_TIMER0_COMPA_vect     _VECTOR(12)         /* Timer/Counter0 Compare Match A */
#define None_TIMER0_COMPB_vect_num (13)                
#define None_TIMER0_COMPB_vect     _VECTOR(13)         /* Timer/Counter0 Compare Match B */
#define None_TIMER0_OVF_vect_num   (14)                
#define None_TIMER0_OVF_vect       _VECTOR(14)         /* Timer/Counter0 Overflow */
#define None_SPI_STC_vect_num      (15)                
#define None_SPI_STC_vect          _VECTOR(15)         /* SPI Serial Transfer Complete */
#define None_USART_START_vect_num  (16)                
#define None_USART_START_vect      _VECTOR(16)         /* USART, Start */
#define None_USART_RX_vect_num     (17)                
#define None_USART_RX_vect         _VECTOR(17)         /* USART Rx Complete */
#define None_USART_UDRE_vect_num   (18)                
#define None_USART_UDRE_vect       _VECTOR(18)         /* USART, Data Register Empty */
#define None_USART_TX_vect_num     (19)                
#define None_USART_TX_vect         _VECTOR(19)         /* USART Tx Complete */
#define None_ADC_vect_num          (20)                
#define None_ADC_vect              _VECTOR(20)         /* ADC Conversion Complete */
#define None_EE_READY_vect_num     (21)                
#define None_EE_READY_vect         _VECTOR(21)         /* EEPROM Ready */
#define None_ANALOG_COMP_vect_num  (22)                
#define None_ANALOG_COMP_vect      _VECTOR(22)         /* Analog Comparator */
#define None_TWI_SLAVE_vect_num    (23)                
#define None_TWI_SLAVE_vect        _VECTOR(23)         /* Two-wire Serial Interface */
#define None_SPM_Ready_vect_num    (24)                
#define None_SPM_Ready_vect        _VECTOR(24)         /* Store Program Memory Read */
#define None_QTRIP_vect_num        (25)                
#define None_QTRIP_vect            _VECTOR(25)         /* Touch Sensing */

/* Vector Table Size */
#define _VECTOR_SIZE               (2)                 /* Size of individual vector. */
#define _VECTORS_SIZE              (26 * _VECTOR_SIZE) /* Size of all vectors */
/*
================================================================================
Constants
================================================================================
*/

